mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2ghxj/common/s6e2ghxj.h
/*******************************************************************************
* BT Registers BT15
*   Register Definition
*******************************************************************************/
#define FM_BT15_PPG_PRLL                          *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_PPG_PRLL                         *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_PWM_PCSR                          *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_PWM_PCSR                         *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_RT_PCSR                           *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_RT_PCSR                          *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_PPG_PRLH                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PPG_PRLH                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PWC_DTBF                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PWC_DTBF                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PWM_PDUT                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PWM_PDUT                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PPG_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_PPG_TMR                          *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_PWM_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_PWM_TMR                          *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_RT_TMR                            *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_RT_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_PPG_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PPG_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PWC_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PWC_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PWM_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PWM_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_RT_TMCR                           *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_RT_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PPG_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PPG_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PWC_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PWC_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PWM_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PWM_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_RT_STC                            *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_RT_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PPG_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PPG_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_PWC_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PWC_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_PWM_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PWM_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_RT_TMCR2                          *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_RT_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))

/*******************************************************************************
* BT Registers BT2
*   Register Definition
*******************************************************************************/
#define FM_BT2_PPG_PRLL                           *((volatile uint16_t*)(0x40025080UL))
#define FM4_BT2_PPG_PRLL                          *((volatile uint16_t*)(0x40025080UL))
#define FM_BT2_PWM_PCSR                           *((volatile uint16_t*)(0x40025080UL))
#define FM4_BT2_PWM_PCSR                          *((volatile uint16_t*)(0x40025080UL))
#define FM_BT2_RT_PCSR                            *((volatile uint16_t*)(0x40025080UL))
#define FM4_BT2_RT_PCSR                           *((volatile uint16_t*)(0x40025080UL))
#define FM_BT2_PPG_PRLH                           *((volatile uint16_t*)(0x40025084UL))
#define FM4_BT2_PPG_PRLH                          *((volatile uint16_t*)(0x40025084UL))
#define FM_BT2_PWC_DTBF                           *((volatile uint16_t*)(0x40025084UL))
#define FM4_BT2_PWC_DTBF                          *((volatile uint16_t*)(0x40025084UL))
#define FM_BT2_PWM_PDUT                           *((volatile uint16_t*)(0x40025084UL))
#define FM4_BT2_PWM_PDUT                          *((volatile uint16_t*)(0x40025084UL))
#define FM_BT2_PPG_TMR                            *((volatile uint16_t*)(0x40025088UL))
#define FM4_BT2_PPG_TMR                           *((volatile uint16_t*)(0x40025088UL))
#define FM_BT2_PWM_TMR                            *((volatile uint16_t*)(0x40025088UL))
#define FM4_BT2_PWM_TMR                           *((volatile uint16_t*)(0x40025088UL))
#define FM_BT2_RT_TMR                             *((volatile uint16_t*)(0x40025088UL))
#define FM4_BT2_RT_TMR                            *((volatile uint16_t*)(0x40025088UL))
#define FM_BT2_PPG_TMCR                           *((volatile uint16_t*)(0x4002508CUL))
#define FM4_BT2_PPG_TMCR                          *((volatile uint16_t*)(0x4002508CUL))
#define FM_BT2_PWC_TMCR                           *((volatile uint16_t*)(0x4002508CUL))
#define FM4_BT2_PWC_TMCR                          *((volatile uint16_t*)(0x4002508CUL))
#define FM_BT2_PWM_TMCR                           *((volatile uint16_t*)(0x4002508CUL))
#define FM4_BT2_PWM_TMCR                          *((volatile uint16_t*)(0x4002508CUL))
#define FM_BT2_RT_TMCR                            *((volatile uint16_t*)(0x4002508CUL))
#define FM4_BT2_RT_TMCR                           *((volatile uint16_t*)(0x4002508CUL))
#define FM_BT2_PPG_STC                            *((volatile  uint8_t*)(0x40025090UL))
#define FM4_BT2_PPG_STC                           *((volatile  uint8_t*)(0x40025090UL))
#define FM_BT2_PWC_STC                            *((volatile  uint8_t*)(0x40025090UL))
#define FM4_BT2_PWC_STC                           *((volatile  uint8_t*)(0x40025090UL))
#define FM_BT2_PWM_STC                            *((volatile  uint8_t*)(0x40025090UL))
#define FM4_BT2_PWM_STC                           *((volatile  uint8_t*)(0x40025090UL))
#define FM_BT2_RT_STC                             *((volatile  uint8_t*)(0x40025090UL))
#define FM4_BT2_RT_STC                            *((volatile  uint8_t*)(0x40025090UL))
#define FM_BT2_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025091UL))
#define FM4_BT2_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025091UL))
#define FM_BT2_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025091UL))
#define FM4_BT2_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025091UL))
#define FM_BT2_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025091UL))
#define FM4_BT2_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025091UL))
#define FM_BT2_RT_TMCR2                           *((volatile  uint8_t*)(0x40025091UL))
#define FM4_BT2_RT_TMCR2                          *((volatile  uint8_t*)(0x40025091UL))

