mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2ghxj/common/s6e2ghxj.h
#define bFM_BT14_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD180UL))
#define bFM4_BT14_PPG_TMCR_STRG                   *((volatile  uint8_t *)(0x424AD180UL))
#define bFM_BT14_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD184UL))
#define bFM4_BT14_PPG_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD184UL))
#define bFM_BT14_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD188UL))
#define bFM4_BT14_PPG_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD188UL))
#define bFM_BT14_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM4_BT14_PPG_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM_BT14_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AD1A8UL))
#define bFM4_BT14_PPG_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AD1A8UL))
#define bFM_BT14_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AD1ACUL))
#define bFM4_BT14_PPG_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AD1ACUL))

#define bFM_BT14_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AD220UL))
#define bFM4_BT14_PPG_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AD220UL))

#define bFM_BT14_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424AD200UL))
#define bFM4_BT14_PWC_STC_OVIR                    *((volatile  uint8_t *)(0x424AD200UL))
#define bFM_BT14_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424AD208UL))
#define bFM4_BT14_PWC_STC_EDIR                    *((volatile  uint8_t *)(0x424AD208UL))
#define bFM_BT14_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424AD210UL))
#define bFM4_BT14_PWC_STC_OVIE                    *((volatile  uint8_t *)(0x424AD210UL))
#define bFM_BT14_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424AD218UL))
#define bFM4_BT14_PWC_STC_EDIE                    *((volatile  uint8_t *)(0x424AD218UL))
#define bFM_BT14_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424AD21CUL))
#define bFM4_BT14_PWC_STC_ERR                     *((volatile  uint8_t *)(0x424AD21CUL))

#define bFM_BT14_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD184UL))
#define bFM4_BT14_PWC_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD184UL))
#define bFM_BT14_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD188UL))
#define bFM4_BT14_PWC_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD188UL))
#define bFM_BT14_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424AD19CUL))
#define bFM4_BT14_PWC_TMCR_T32                    *((volatile  uint8_t *)(0x424AD19CUL))

#define bFM_BT14_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AD220UL))
#define bFM4_BT14_PWC_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AD220UL))

#define bFM_BT14_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424AD200UL))
#define bFM4_BT14_PWM_STC_UDIR                    *((volatile  uint8_t *)(0x424AD200UL))
#define bFM_BT14_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424AD204UL))
#define bFM4_BT14_PWM_STC_DTIR                    *((volatile  uint8_t *)(0x424AD204UL))
#define bFM_BT14_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424AD208UL))
#define bFM4_BT14_PWM_STC_TGIR                    *((volatile  uint8_t *)(0x424AD208UL))
#define bFM_BT14_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424AD210UL))
#define bFM4_BT14_PWM_STC_UDIE                    *((volatile  uint8_t *)(0x424AD210UL))
#define bFM_BT14_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424AD214UL))
#define bFM4_BT14_PWM_STC_DTIE                    *((volatile  uint8_t *)(0x424AD214UL))
#define bFM_BT14_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424AD218UL))
#define bFM4_BT14_PWM_STC_TGIE                    *((volatile  uint8_t *)(0x424AD218UL))

#define bFM_BT14_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD180UL))
#define bFM4_BT14_PWM_TMCR_STRG                   *((volatile  uint8_t *)(0x424AD180UL))
#define bFM_BT14_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD184UL))
#define bFM4_BT14_PWM_TMCR_CTEN                   *((volatile  uint8_t *)(0x424AD184UL))
#define bFM_BT14_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD188UL))
#define bFM4_BT14_PWM_TMCR_MDSE                   *((volatile  uint8_t *)(0x424AD188UL))
#define bFM_BT14_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM4_BT14_PWM_TMCR_OSEL                   *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM_BT14_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424AD1A8UL))
#define bFM4_BT14_PWM_TMCR_PMSK                   *((volatile  uint8_t *)(0x424AD1A8UL))
#define bFM_BT14_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424AD1ACUL))
#define bFM4_BT14_PWM_TMCR_RTGEN                  *((volatile  uint8_t *)(0x424AD1ACUL))

#define bFM_BT14_PWM_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424AD220UL))
#define bFM4_BT14_PWM_TMCR2_CKS3                  *((volatile  uint8_t *)(0x424AD220UL))

#define bFM_BT14_RT_STC_UDIR                      *((volatile  uint8_t *)(0x424AD200UL))
#define bFM4_BT14_RT_STC_UDIR                     *((volatile  uint8_t *)(0x424AD200UL))
#define bFM_BT14_RT_STC_TGIR                      *((volatile  uint8_t *)(0x424AD208UL))
#define bFM4_BT14_RT_STC_TGIR                     *((volatile  uint8_t *)(0x424AD208UL))
#define bFM_BT14_RT_STC_UDIE                      *((volatile  uint8_t *)(0x424AD210UL))
#define bFM4_BT14_RT_STC_UDIE                     *((volatile  uint8_t *)(0x424AD210UL))
#define bFM_BT14_RT_STC_TGIE                      *((volatile  uint8_t *)(0x424AD218UL))
#define bFM4_BT14_RT_STC_TGIE                     *((volatile  uint8_t *)(0x424AD218UL))

#define bFM_BT14_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424AD180UL))
#define bFM4_BT14_RT_TMCR_STRG                    *((volatile  uint8_t *)(0x424AD180UL))
#define bFM_BT14_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424AD184UL))
#define bFM4_BT14_RT_TMCR_CTEN                    *((volatile  uint8_t *)(0x424AD184UL))
#define bFM_BT14_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424AD188UL))
#define bFM4_BT14_RT_TMCR_MDSE                    *((volatile  uint8_t *)(0x424AD188UL))
#define bFM_BT14_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM4_BT14_RT_TMCR_OSEL                    *((volatile  uint8_t *)(0x424AD18CUL))
#define bFM_BT14_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424AD19CUL))
#define bFM4_BT14_RT_TMCR_T32                     *((volatile  uint8_t *)(0x424AD19CUL))

